import { TextChannel } from 'discord.js';
import { CommandWithoutArgs } from '../commands/commands';

export const help: CommandWithoutArgs = async (commandChannel: TextChannel) => {
  await commandChannel.send(
    'Команди(для створення опитування): \n' +
      '!pol: && - Опитування на тему "&&" \n' +
      '!open: - Відкриття засідання \n' +
      '!close: - Закриття засідання \n' +
      'Комади(Для взаємодії з порядком денним): \n' +
      '!set: ../../.. - Формування порядку денного з певного переліку пунктів \n' +
      // eslint-disable-next-line max-len
      '!set: ..|../.. - Такі аргументи з "|" працюють за принципом що ліва частина до "|" потрапляє в порядок денний, а права частина потрапляє в список до команди !next:\n' +
      // eslint-disable-next-line max-len
      '!next: - Рухається по пунктам голосування оголошених в !set: (Автоматично додаються пункти Відкриття засідання, Затвердження порядку денного, і Закриття засідання)\n' +
      '!today_info: Повідомляє в чат голосування порядок денний \n' +
      '!today: Створення голосування за прийняття порядку денного',
  );
};
