import { TextChannel } from 'discord.js';
import { CommandWithoutArgs } from '../commands/commands';

export const help: CommandWithoutArgs = async (commandChannel: TextChannel) => {
  await commandChannel.send(
    `**Список команд:**\n
**Для створення опитування:**
\`\`\`
!pol: &&          - Опитування на тему "&&"
!open:            - Відкриття засідання
!close:           - Закриття засідання
\`\`\`

**Для взаємодії з порядком денним:**
\`\`\`
!set: ../../..    - Формування порядку денного з певного переліку пунктів
!set: ..|../..    - Ліва частина до "|" потрапляє в порядок денний,
                    а права — у список до команди !next:
                    
!next:            - Рухається по пунктам голосування, оголошених у !set:
                    (Додаються автоматично: Відкриття засідання, 
                     Затвердження порядку денного, Закриття засідання)

!today_info:      - Виводить в чат голосування порядок денний
!today:           - Створення голосування за прийняття порядку денного
\`\`\`

*Всі команди повинні починатися зі знака оклику (!) для коректного виконання.*`,
  );
};
